practice-for-ch-rails-reddit-long-practice-main/reddit_clone/app/models/user.rb

SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "eltionbehrami"], ["LIMIT", 1]]
---
    def self.find_by_credentials(username, password)
        @user = User.find_by(username: username)

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "[FILTERED]"], ["updated_at", "2023-10-06 14:40:03.775950"], ["id", 1]]
---
    def reset_session_token!
        self.session_token = generate_session_token
        self.save!